In [2]:
import numpy as np
import pandas as pd

Задание 1

In [3]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Тургенев', 'Чехов', 'Островский']}, columns=['author_id', 'author_name'])

In [4]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [5]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title', 'price'])

In [6]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [7]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'right')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [8]:
top_5 = authors_price.head(5)
top_5

   author_id author_name         book_title  price
0          1    Тургенев        Отцы и дети    450
1          1    Тургенев              Рудин    300
2          1    Тургенев  Дворянское гнездо    350
3          2       Чехов   Толстый и тонкий    500
4          2       Чехов    Дама с собачкой    450

Задание 4

In [11]:
authors_stat = authors_price.copy()
authors_stat['min_price'] = authors_stat['price'].min()
authors_stat.set_index('author_id', inplace=True)
authors_stat

          author_name            book_title  price  min_price
author_id
1            Тургенев           Отцы и дети    450        290
1            Тургенев                 Рудин    300        290
1            Тургенев     Дворянское гнездо    350        290
2               Чехов      Толстый и тонкий    500        290
2               Чехов       Дама с собачкой    450        290
3          Островский                 Гроза    370        290
3          Островский  Таланты и поклонники    290        290

In [14]:
authors_stat = authors_stat.groupby('author_id').agg({'price':'max'})
authors_stat

           price
author_id
1            450
2            500
3            370